import numpy as np

'''
访问高维数组元素 
    索引访问高维数组 
        多维数组索引访问有两种表达式：
        表达式1：np.array[0轴索引][1轴索引]...[n-1轴索引]
        表达式2：np.array[0 轴索引, 1轴索引,...,  n-1轴索引] 

    索引访问三维数组元素 a[i, j, k]:
        a[i, j, k]返回单个数值（标量） 
        a[i, j] 返回一维数组（向量）
        a[i] 返回二维数组（矩阵）
    切片访问高维数组 
        语法格式和二维数组类似：
        np.array[所在 0 轴切片, 所在 1 轴切片,..., 所在 n-1 轴切片]
'''

a1 = np.array([[[1, 2, 3], [4, 5, 6]],
               [[7, 8, 9], [10, 11, 12]]])
print(a1)
print(a1.ndim)
print(a1.shape)

# a2 = np.random.randint(1,10,size=(2,3,4,5))
# print(a2)

print(a1[0][1][2])  # 6
print(a1[0, 1, 2])  # 6
print(a1[:, 1, 1:])
